Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [3]:
import pandas as pd

In [36]:
movies_data = pd.read_csv('/Users/lalitatsarkova/Desktop/git/netology--dmar/ml-latest-small/movies.csv')
movies_data[['movieId', 'title']].head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [37]:
ratings_data = pd.read_csv('/Users/lalitatsarkova/Desktop/git/netology--dmar/ml-latest-small/ratings.csv')
ratings_data[['movieId','rating']].head()

   movieId  rating
0        1     4.0
1        3     4.0
2        6     4.0
3       47     5.0
4       50     5.0

In [45]:
joined = ratings_data.merge(movies_data, on = 'movieId', how ='left')
joined[['movieId','rating','title']].head()

   movieId  rating                        title
0        1     4.0             Toy Story (1995)
1        3     4.0      Grumpier Old Men (1995)
2        6     4.0                  Heat (1995)
3       47     5.0  Seven (a.k.a. Se7en) (1995)
4       50     5.0   Usual Suspects, The (1995)

In [42]:
max_ = ratings_data['rating'].max()
filtered_joined = joined[(joined ['rating'] == max_)]
fr = filtered_joined.groupby(['movieId' , 'title'])['movieId'].count()

In [43]:
fr.sort_values(ascending=False).head()

movieId  title
318      Shawshank Redemption, The (1994)             153
296      Pulp Fiction (1994)                          123
356      Forrest Gump (1994)                          116
2571     Matrix, The (1999)                           109
260      Star Wars: Episode IV - A New Hope (1977)    104
Name: movieId, dtype: int64

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 го

In [46]:
power = pd.read_csv('/Users/lalitatsarkova/Desktop/git/netology--dmar/10 - pandas basics/power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [49]:
power['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71])

In [47]:
baltic_countries = power[(power['country']=='Estonia') | (power['country']=='Lithuania') | (power['country']=='Latvia') ]
baltic_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [51]:
bc = baltic_countries[(baltic_countries['category']==4) | (baltic_countries['category']==12) | (baltic_countries['category']==21) & (baltic_countries['year']<2010) & (baltic_countries['year']>2005)]

In [52]:
print('Количество потребления для стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно {}КВт'.format(bc['quantity'].sum()))

Количество потребления для стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно 165867.0КВт

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [10]:
import pandas as pd
from pandas.io.html import read_html

In [11]:
data=pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', attrs = {'class': 'quote_list'}, encoding='utf-8')[0]
data.head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,1006663,-,1011254,"-0,45 %",-04591,00:14:00
1,NaN,EUR/RUB,912040,-,912570,"-0,06 %",-00530,00:13:00
2,NaN,USD/RUB,779330,-,776813,"0,32 %",02517,00:12:00
3,NaN,JPY/RUB,07396,-,07390,"0,08 %",00006,00:13:00
4,NaN,CNY/RUB,115960,-,115681,"0,24 %",00278,00:12:00